{"/_app":{"title":" App","data":{"":""}},"/404":{"title":"404: Page Not Found","data":{"":"MiaoMiaoMiaoMiaoMiao"}},"/500":{"title":"Fsck","data":{"":""}},"/about":{"title":"About Me","data":{"":"Hi! I am yuzukicat / ゆずきねこ / 柚子猫猫.A Cat knows human language.Playing with Rust / NixOS."}},"/blog/a-test-page":{"title":"A Test Page using mdx, NextJS, SSG, Cloudflare","data":{"":"一些暴論\n\n#![feature(drain_filter)]\nuse std::collections::LinkedList;\n\nlet mut numbers: LinkedList<u32> = LinkedList::new();\nnumbers.extend(&[1, 2, 3, 4, 5, 6, 8, 9, 11, 13, 14, 15]);\n\nlet evens = numbers.drain_filter(|x| *x % 2 == 0).collect::<LinkedList<_>>();\nlet odds = numbers;\n\nassert_eq!(evens.into_iter().collect::<Vec<_>>(), vec![2, 4, 6, 8, 14]);\nassert_eq!(odds.into_iter().collect::<Vec<_>>(), vec![1, 3, 5, 9, 11, 13, 15]);\nReference doc.rust-lang.org","another-test#Another Test":"fn main() {\n// 编译器自动推导出one的类型\nlet one             = [1, 2, 3];\n// 显式类型标注\nlet two: [u8; 3]    = [1, 2, 3];\nlet blank1          = [0; 3];\nlet blank2: [u8; 3] = [0; 3];\n\n// arrays是一个二维数组，其中每一个元素都是一个数组，元素类型是[u8; 3]\nlet arrays: [[u8; 3]; 4]  = [one, two, blank1, blank2];\n\n// 借用arrays的元素用作循环中\nfor a in &arrays {\nprint!(\"{:?}: \", a);\n// 将a变成一个迭代器，用于循环\n// 你也可以直接用for n in a {}来进行循环\nfor n in a.iter() {\nprint!(\"\\t{} + 10 = {}\", n, n+10);\n}\n\nlet mut sum = 0;\n// 0..a.len,是一个 Rust 的语法糖，其实就等于一个数组，元素是从0,1,2一直增加到到a.len-1\nfor i in 0..a.len() {\nsum += a[i];\n}\nprintln!(\"\\t({:?} = {})\", a, sum);\n}\n}\nReference course.rs"}},"/blog/dalle-e-food-plating":{"title":"Using Dalle-e generative AI to generate food plating images for chef","data":{"":"","what-is-generative-ai#What Is Generative Ai":"Artificial Intelligence (AI) has been a buzzword for quite some time now. It has revolutionized the way we live, work, and interact with technology. One of the most exciting applications of AI is Generative AI, which has the potential to create new and innovative designs, art, and even food plating. In this article, we will explore what Generative AI is, its history, and how it can be used to create stunning food plating.","what-is-it#What Is It?":"Generative AI is a subset of AI that involves the use of algorithms to generate new and unique content. It is different from traditional AI, which is designed to solve specific problems. Generative AI is more creative and can produce new content that has never been seen before. It is used in various fields, including art, music, and design.","history#History":"Generative AI has been around for quite some time. The first generative algorithm was developed in the 1950s by a computer scientist named John von Neumann. However, it was not until the 1990s that Generative AI started gaining popularity. In 1997, a computer program called AARON was developed, which could create original art. Since then, Generative AI has been used in various fields, including music, design, and even food plating.","idea-behind#Idea Behind":"The idea behind Generative AI is to create something new and unique. It involves the use of algorithms that can learn from data and generate new content based on that data. The algorithms can be trained on various datasets, including images, text, and audio. Once the algorithm is trained, it can generate new content that is similar to the data it was trained on.","tools#Tools":"There are various tools available for Generative AI, including ChatGPT, DaliE, and Midjorney. These tools use different algorithms to generate new content. ChatGPT is a language model that can generate text based on a given prompt. DaliE is an image generation tool that can create new images based on a given input. Midjorney is a music generation tool that can create new music based on a given input.","what-we-are-going-to#What We Are Going To":"","how-we-can-use-these-ai-for-food#How We Can Use These Ai for Food":"Generative AI has the potential to revolutionize the way we create food plating designs.","what-is-foodplatingai#What Is Foodplating.ai":"Food plating is an art form that involves arranging food on a plate in an aesthetically pleasing way. It requires creativity and skill to create a visually appealing dish. Generative AI can be used to create new and innovative food plating designs. FoodPlating.AI is a tool that uses Generative AI to create new food plating designs. It can generate new designs based on various inputs, including the type of cuisine, ingredients, and plating style.By using tools like ChatGPT, DaliE, or Midjorney, we can generate new and innovative designs that have never been seen before. With our solutions and techniques, we can create stunning and visually appealing food plating designs that will delight and amaze diners.","technical-difficulties#Technical Difficulties":"Using Generative AI for food plating is not without its challenges. One of the main challenges is the lack of data. Unlike other fields, there is limited data available on food plating. This makes it difficult to train the algorithms on food plating. Another challenge is the subjective nature of food plating. What one person finds aesthetically pleasing may not be the same for another person.","what-we-make--configurations#What We Make / Configurations":"To overcome the challenges of using Generative AI for food plating, we  use tools like ChatGPT, DaliE, or Midjorney. These tools can be trained on various datasets, including images of food, recipes, and plating styles. By using these tools, we can generate new and innovative food plating designs. Additionally, we can create a website on FoodGPT that allows users to input various parameters, such as cuisine, ingredients, and plating style, to generate new food plating designs.","some-test-results#Some Test Results":"","totally-imaginary-combinations#Totally Imaginary Combinations":"","prompt-with-chef-name#Prompt with Chef Name":"キャビア 甲殻類のジュレになめらかなカリフラワーのクレーム by Martin Yan in Nordic plating\n\n\n\nすきやばし次郎が作るキャビア 甲殻類のジュレになめらかなカリフラワーのクレーム","prompt-with-style#Prompt with Style":"","noma-scandinavian-uni-signature-dishes#Noma Scandinavian Uni Signature Dishes":"","prompt-with-combinations#Prompt with Combinations":"","eggplant-bonito-green-french-style-appetizer#Eggplant Bonito Green French Style Appetizer":"","salmon-apple-ginger-yuzu-appetizer-innovative#Salmon Apple Ginger Yuzu Appetizer Innovative":"","synthetic-pic-comparison--vs-real-pic#Synthetic Pic Comparison  vs Real Pic":"","joel-robuchon-uni-signature-dishes#Joel Robuchon Uni Signature Dishes":"","generative-ai#Generative Ai":"","real#Real":"","wild-mushroom-autumn-appetizer#Wild Mushroom Autumn Appetizer":"With season key word!","generative-ai-1#Generative Ai":"","real-1#Real":""}},"/archive":{"title":"Blog - Archive","data":{"":""}},"/blog/tag/[tag]":{"title":"Blog","data":{"":""}},"/":{"title":"A Cat knows human language","data":{"":""}},"/tag":{"title":"Blog - Tag","data":{"":""}}}